package module1;

/**
 * Напишите программу, выводящую в консоль It's alive! It's alive!
 * <p>
 * Класс должен называться "Main", это ограничение проверяющей системы.
 * <p>
 * Sample Input:
 * Sample Output:
 * It's alive! It's alive!
 * <p>
 * <p>
 * <p>
 * Created by Andrey on 25.09.2016.
 */
public class Step1_2_14 {
    public static void main(String[] args) {
        System.out.println("It's alive! It's alive!");
    }
}
